In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:SecureP%40sw0rd%21123@localhost:3306/united_nations

In [3]:
%%sql

SELECT
    *
FROM
    Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2015, Decimal('94.67'), Decimal('98.00'), Decimal('17.542806'), Decimal('184.39'), Decimal('2699700.00')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2016, Decimal('94.67'), Decimal('98.00'), Decimal('17.794055'), Decimal('137.28'), Decimal('2699700.00')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2017, Decimal('95.00'), Decimal('98.00'), Decimal('18.037776'), Decimal('166.81'), Decimal('2699700.00')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2018, Decimal('95.00'), Decimal('98.00'), Decimal('18.276452'), Decimal('179.34'), Decimal('2699700.00')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2019, Decimal('95.00'), Decimal('98.00'), Decimal('18.513673'), Decimal('181.67'), Decimal('2699700.00'))]

# 1. What is the total number of entries in the dataset?

In [10]:
%%sql

SELECT count(*) 
as "total number of entries" 
from Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(1050,)]

## 2. What are the earliest and latest years for which we have data?

In [12]:
%%sql

select 
    max(Time_period) as earliest,
    min(Time_period) as latest
from 
    Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(2020, 20)]

## 3. How many countries are included in this dataset?

In [19]:
%%sql 

select 
    count(distinct Country_name) as countries
from 
    Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(184,)]

## 4. What is the average percentage of people who have access to managed drinking water services across all years and all countries included in our dataset?

In [23]:
%%sql

select 
    avg(Pct_managed_drinking_water_services) as "average drinking wate"
from 
     Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(Decimal('87.189103'),)]

In [24]:
%%sql

SELECT
    COUNT(*) AS Number_of_observations,
    MIN(Time_period) AS Min_time_period,
    MAX(Time_period) AS Max_time_period,
    COUNT(DISTINCT Country_name) AS Number_of_countries,
    AVG(Pct_managed_drinking_water_services) AS AVG_managed_drinking_water_services
FROM united_nations.Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(1050, 20, 2020, 184, Decimal('87.189103'))]